public/citron.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-07-20 Wed 20:58 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>citron</title>
<meta name="author" content="Aziz Ben Ali" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/stylesheets/main.css">
<link rel="icon" type="image/x-icon" href="/images/favicon.ico">
</head>
<body>
<div id="preamble" class="status">
<ul class="navigation">
  <li> <a href="/index.html">Home</a> </li>
  <li> <a href="/contact.html">Contact</a> </li>
  <li> <a href="/resume.html">Résumé</a> </li>
</ul>
</div>
<div id="content" class="content">
<header>
<h1 class="title">citron</h1>
</header><p>
<a href="https://git.sr.ht/~grtcdr/citron">citron</a> is a lightweight utility that provides system data via
on-demand notifications. It essentially replaces the need for the
traditional taskbar, without bringing the whole kit and caboodle.
</p>

<p>
citron is:
</p>
<ul class="org-ul">
<li>designed with customization<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> and freedom<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup> in mind.</li>
<li>environment-agnostic; runs anywhere, on anything.</li>
<li>neatly integrated with your desktop via a notification daemon of your choosing.</li>
<li>contextually-aware of the system state when configured to use an
icon theme of your liking.</li>
</ul>

<p>
For more information on citron, head over to the <a href="https://man.sr.ht/~grtcdr/citron/">wiki</a>.
</p>

<hr>

<p>
<b>Fun fact</b>: citron is very low on system resources.
</p>

<p>
Don't take my word for it, see for yourself:
</p>

<pre class="example" id="orgaa1efc5">
==184942== Memcheck, a memory error detector
==184942== Copyright (C) 2002-2017, and GNU GPL'd, by Julian Seward et al.
==184942== Using Valgrind-3.18.1 and LibVEX; rerun with -h for copyright info
==184942== Command: citron memory
==184942== 
==184942== 
==184942== HEAP SUMMARY:
==184942==     in use at exit: 3,070 bytes in 34 blocks
==184942==   total heap usage: 364 allocs, 330 frees, 51,981 bytes allocated
==184942== 
==184942== LEAK SUMMARY:
==184942==    definitely lost: 0 bytes in 0 blocks
==184942==    indirectly lost: 0 bytes in 0 blocks
==184942==      possibly lost: 0 bytes in 0 blocks
==184942==    still reachable: 3,070 bytes in 34 blocks
==184942==         suppressed: 0 bytes in 0 blocks
==184942== Rerun with --leak-check=full to see details of leaked memory
==184942== 
==184942== For lists of detected and suppressed errors, rerun with: -s
==184942== ERROR SUMMARY: 0 errors from 0 contexts (suppressed: 0 from 0)
</pre>

<p>
&gt; Pulls out calculator.
</p>

<p>
51,981 B is ± 0.05 MB - demonstrating how neatly this citron tool I've been telling you all about, deals with your memory.
</p>

<p>
You probably already have a notification daemon running, so why not
use it to its full potential?
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Notification content can be customized with special formatters.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
Not opinionated; your system, your rules. Map any (or all) of
its subcommands to a keybinding in your window manager/desktop
environment, et voilà, you're good to go!
</p></div></div>


</div>
</div></div>
</body>
</html>
